app/controllers/movies_controller.rb

  def same_director
    @movie = Movie.find(params[:id])
    @movies_same_director = Movie.where(director: @movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("rating", "created_at", "updated_at") VALUES (?, ?, ?)  [["rating", "1"], ["created_at", "2019-10-23 00:28:55.183029"], ["updated_at", "2019-10-23 00:28:55.183029"]]